Revit 2024 API
IFCHybridImport Constructor
 Constructs a new IFCHybridImport instance for importing IFC via Hybrid method.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public IFCHybridImport()
Visual Basic
Public Sub New
Visual C++
public:
IFCHybridImport()
See Also
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace